{
    "HOMNE": {
      "INFORMATION": {
        "ABOUT": "Sobre mi",
        "INFO": "Desenvolupador de programari",
        "DESCRIPTION": "Desenvolupament de projectes amb les plataformes Android, Blackberry i Web (Angular 15, Vue 3). Aprenentatge ràpid. Motivat. Ampli coneixement en el sector bancari i d'assegurances.",
        "DESCRIPTION_ACTUAL": "Sóc un desenvolupador especialitzat en frameworks de JavaScript, amb un enfocament principal en Angular. He treballat amb AngularJS i amb totes les versions posteriors d'Angular, incloent-hi la versió més recent. Actualment, formo part d'una consultora on col·laboro amb clients del sector assegurador. Les meves responsabilitats inclouen l'estimació i desenvolupament de noves funcionalitats des de zero, resolució d'incidències, i actualització de projectes des de versions antigues a les més recents. Tinc més de 8 anys d'experiència en Angular, amb un sòlid coneixement en la construcció d'aplicacions web robustes i escalables. A més, tinc un domini avançat dels sistemes de control de versions, especialment Git. Pel que fa a desplegament i gestió de projectes, utilitzem Azure DevOps. Les meves responsabilitats inclouen la configuració i manteniment de pipelines d'integració contínua i desplegament continu (CI/CD) per automatitzar els processos de construcció, proves i desplegament de les nostres aplicacions. Configuro triggers de pipelines per a integracions automàtiques i desplegaments basats en branques específiques, gestionant artefactes i dependències per assegurar desplegaments coherents i controlats. Addicionalment, gestiono la configuració de releases, creant definicions de release que abasten múltiples entorns, com desenvolupament (DEV), preproducció (PRE) i producció (PRO). Implemento estratègies de desplegament com desplegaments blue-green i canary, i utilitzo variables d'entorn i configuracions específiques per a cada entorn per garantir una transició fluida i segura entre versions. Tinc experiència en la configuració de Nginx, que utilitzem per gestionar les rutes i variables d'entorn necessàries per al correcte funcionament de les nostres aplicacions i la seguretat de les crides API.",
        "FULL_NAME": "Nom complet",
        "PHONE": "Telèfon",
        "EMAIL": "Correu electrònic",
        "ADDRESS": "Adreça",
        "HELLO": "Hola!",
        "RESUME": "El meu currículum",
        "WORK": "Experiència laboral",
        "SENIOR": "Desenvolupador Sènior",
        "JUNIOR": "Desenvolupador Junior",
        "EDUCATION": "Education",  
        "BABEL": "Desenvolupador Front-end en aplicacions d'assegurances amb Angular 15",
        "BETWEEN": "Treballant per al client Infomed Software",
        "ALTEN": "Desenvolupament d'aplicacions web en l'API de Vue 3. Desenvolupador d'aplicacions mòbils i web per a l'empresa Alten utilitzant el framework Angular 12, TypeScript. Desenvolupament d'aplicacions mòbils en IONIC 5 i Angular 10 per al port de Barcelona. Desenvolupament en Angular 2/4/5/6 amb creació de components. Ús de tuberies, creació i ús de serveis. Accés a dades a través d'HTTP, ús d'observables, enviament de sol·licituds HTTP, subscripcions a col·leccions observables. Rutes i navegació. Ús de les biblioteques de components ngx-bootstrap i ng-bootstrap, així com de la biblioteca NgRx i RxJs.",
        "WIKOT": "Desenvolupament i adaptació de llocs web utilitzant llenguatges de programació com PHP, HTML, jQuery, JavaScript. Ús del framework yii2 i angular.js, així com l'ús de gestors de contingut com Wordpress i Prestashop.",
        "AVANADE": "Desenvolupament en les estadístiques de seguiment de la pàgina web de receptes electròniques integrals (SIRE), en llenguatge C#, asp.net, base de dades SqlServer.",
        "SYNERGY": "Desenvolupament d'aplicacions mòbils per a dispositius Android i Blackberry dirigides a la indústria bancària i d'assegurances. Anàlisi de requisits en l'àrea de mobilitat i preparació d'estimacions de temps. Responsable de proporcionar formació per a l'ús de les eines git i gitflow en els projectes de l'empresa. Treball amb clients principalment a Veneçuela i Panamà. Ús de la metodologia SCRUM.",
        "OUTSOURCE": "Desenvolupament del Sistema de Gestió de Recursos Humans, desenvolupament del mòdul de selecció i reclutament de personal, automatització de les proves d'ortografia, color i reven, i desenvolupament dels mòduls de contracte, vacances, aplicació de Prova de Treball, Anticipo de Beneficis, balanços de beneficis socials i avaluació de rendiment, programat en llenguatge C#, asp.net.",
        "MICORP": "Migració de la base de dades Oracle a Postgres del sistema de màrqueting de hidrocarburs (SCH). Desenvolupament del mòdul d'ETL i validació de les dades migrades en llenguatge PHP.",
        "COMPUTERINFO": "Enginyer Informàtic",
        "COMPUTERTITULO": "Grau en Enginyeria Informàtica",
        "COURSE": "Llicències i certificacions",
        "QUALIFICATION": "Qualificació com a batxiller en ciències",
        "STUDYTITLE": "Grau de Batxiller",
        "COURSETITLE1": "Jornada: Aplicacions Mòbils funcionals (Programació de components de jQuery mobile i interacció dinàmica amb l'usuari)",
        "COURSETITLE2": "Jornada: Desenvolupament d'aplicacions mòbils amb HTML + CSS + JavaScript + jQuery ONLINE",
        "COURSETITLE3": "Jornada: Disseny d'aplicacions mòbils amb jQuery mobile (Components i interfície d'usuari) ONLINE",
        "COURSETITLE4": "React - La guia completa",
        "COURSETITLE5": "React Js",
        "COURSETITLE6": "Ionic 3",
        "CREDENTIALREACT": "Credencial UC-3ae1e785-b030-4274-9a9c-e332e2bc6fc0",
        "CREDENTIALREACTJS": "Credencial UC-HPCLSXNI",
        "CREDENTIALIONIC3": "Credencial UC-ZQ6ND0Z2",
        "CREDENTIALCOURSE1": "Credencial COD-83554",
        "CREDENTIALCORUSE2": "Credencial COD-83548",
        "CREDENTIALCORUSE3": "Credencial COD-83551",
        "SHOWCREDENTIAL": "Mostrar credencial",
        "TITLE_WORK": "Feina",
        "SKILL": "Habilitat",
        "HIRE_ME": "Contracta'm!",
        "CONTACT_US": "Contacta'ns",
        "HIRE_ME_INFO": "Amb més de 12 anys d'experiència en el món de la informàtica, em complau presentar-me com un desenvolupador Frontend altament experimentat i apassionat, especialitzat en les últimes versions d'Angular. Al llarg de la meva carrera, he cultivat una sòlida reputació pel meu compromís amb l'excel·lència tècnica, la meva habilitat per adaptar-me ràpidament a nous reptes i el meu enfocament disciplinat en l'entrega de resultats excepcionals. La meva trajectòria inclou la creació d'interfícies d'usuari innovadores i funcionals per a una àmplia gamma d'aplicacions web, des de projectes d'escala empresarial fins a aplicacions mòbils. He liderat equips de desenvolupament, aportant no només les meves habilitats tècniques, sinó també la meva capacitat per inspirar i motivar els meus companys cap al èxit conjunt. Em considero un etern aprenent i estic constantment buscant noves oportunitats per expandir els meus coneixements i habilitats. Estic convençut que la indústria de la tecnologia avança a un ritme vertiginós, i estic compromès a mantenir-me al corrent de les últimes tendències i pràctiques per oferir solucions de vanguardia als nostres clients. El meu enfocament en la responsabilitat, la dedicació i la millora contínua m'ha permès destacar en entorns exigents i dinàmics. Estic desitjós de portar la meva experiència i passió per la tecnologia al seu equip, contribuint al èxit dels seus projectes i al creixement de la seva empresa. Quedo a la seva disposició per discutir com puc ser un actiu valuós per al seu equip i per respondre a qualsevol pregunta que pugui tenir."
      },
      "SERVICE": {
        "MY_SERVICE": "Els meus serveis",
        "INTERFACE": "Desenvolupament d'interfícies d'usuari (UI)",
        "DESCRIPTION_INTERFACE": "Crear interfícies d'usuari interactives i atractives utilitzant Angular per millorar l'experiència de l'usuari.",
        "API_INTEGRATION": "Integració d'API",
        "API_INTEGRATION_DESCRIPTION": "Connectar l'aplicació frontend amb serveis backend mitjançant la integració d'API per obtenir i enviar dades de manera eficient.",
        "TECNIC": "Assessorament tècnic i consultoria",
        "TECNIC_DESCRIPTION": "Proporcionar assessorament tècnic sobre les millors pràctiques de desenvolupament en Angular, arquitectura d'aplicacions, i recomanacions per millorar l'eficiència i l'escalabilitat.",
        "WEB_APPLICATION": "Desenvolupament d'aplicacions web",
        "WEB_APPLICATION_DESCRIPTION": "Construir aplicacions web escalables i eficients utilitzant Angular com a framework principal.",
        "UPDATE": "Manteniment i actualització",
        "UPDATE_INFORMATION": "Proporcionar serveis de manteniment continu per assegurar que l'aplicació Angular estigui actualitzada, segura i funcionant sense problemes.",
        "TEST": "Proves i depuració",
        "TEST_DESCRIPTION": "Realitzar proves exhaustives i depuració per identificar i solucionar errors, assegurant la qualitat del codi i l'estabilitat de l'aplicació."
      },
      "PROJECT": {
        "TITLE": "Projectes Destacats",
        "DESCRIPTION": "En la meva secció de Projectes Destacats, destaco alguns dels treballs més destacats en els quals he tingut el privilegi de participar. Des de innovadores aplicacions web fins a emocionants projectes de desenvolupament, cada projecte reflecteix el meu compromís amb l'excel·lència i la creativitat en cada pas del procés. Explora la meva selecció per descobrir com he transformat idees en solucions tangibles i exitoses.",
        "COMMERZBANK_DESCRIPTION": "Es va realitzar manteniment a l'aplicació a nivell de component, es van fer millores i es van resoldre els incidents reportats pel departament de control de qualitat (QA).",
        "HTG_DESCRIPTION": "En aquest projecte, es van dur a terme processos evolutius requerits pel client, es va mantenir un component de taula desenvolupat des de zero i personalitzat segons les necessitats del client, i es va treballar en formularis reactius. Es van resoldre incidents en producció reportats pel client.",
        "PORTIC_DESCRIPTION": "Per a aquest projecte, es va redisenyar la part del frontend per adaptar-la a les millors pràctiques en termes d'usabilitat, visibilitat i disseny, la qual cosa va resultar en una aplicació més simple orientada a les transaccions que es realitzen en ella. Es va dur a terme una reenginyeria de les bases de les aplicacions amb la finalitat de desglossar el concepte actual d'arxiu i adaptar així les aplicacions a la realitat que ocorre en la plataforma. Per a aquesta aplicació, es va utilitzar Angular 8, amb les biblioteques NgRx per a la gestió de l'estat, RxJs per a la gestió de dades asíncrones, l'aplicació conté una biblioteca de components específics del client desenvolupada amb ngx-boostrap, l'aplicació també compta amb un mòdul per a múltiples idiomes.",
        "READ_MORE": "Llegir més",
        "SHOW_LESS": "Mostrar menys"
      },
      "CONTACT": {
        "TITLE": "Contacte",
        "FIRST_NAME": "El teu nom",
        "VALIDATE_FIRST_NAME": "Completa el nom",
        "LAST_NAME": "El teu cognom",
        "VALIDATE_LAST_NAME": "Completa el cognom",
        "EMAIL_ADDRESS": "La teva adreça de correu electrònic",
        "VALIDATE_EMAIL_ADDRESS": "Completa el correu electrònic",
        "SUBJECT_MESSAGE": "El tema d'aquest missatge",
        "VALIDATE_SUBJECT_MESSAGE": "Completa el tema",
        "ABOUT_US": "El teu missatge",
        "VALIDATE_ABOUT_US": "Completa el missatge",
        "SEND_MESSAGE": "Enviar missatge"
      },
      "FOOTER": {
        "TITLE_RESERVED": "2024 Angular. Tots els drets reservats.",
        "DESIGNED": "Dissenyat per"
      }
  }
}
  