{
    "HOMNE": {
      "INFORMATION": {
        "ABOUT": "About Me",
        "INFO": "Software Developer",
        "DESCRIPTION": "I am a developer specializing in JavaScript frameworks, with a primary focus on Angular. During my professional career, I have worked with AngularJS and all subsequent versions of Angular, including the most recent one. Previously, I was part of a consultancy company where I collaborated with clients in the insurance sector. My responsibilities included estimating and developing new functionalities from scratch, troubleshooting issues, and upgrading projects from previous versions to the most recent ones. In addition to my front-end experience, I have also worked as a full stack developer, leading projects where I developed and maintained the back-end logic using .NET and, in some cases, Java. This experience has allowed me to build complete applications and deeply understand both the client and server side. I have more than 8 years of experience in Angular and solid knowledge in building robust and scalable web applications. I also have an advanced command of version control systems, especially Git. Thanks to my diverse experience and my ability to learn, I consider myself a full stack developer capable of adapting to any work test and contributing effectively to multidisciplinary teams.",
        "DESCRIPTION_ACTUAL": "I am a developer specializing in JavaScript frameworks, with a primary focus on Angular. I have worked with AngularJS and all subsequent versions of Angular, including the latest version. Currently, I am part of a consultancy company where I collaborate with clients in the insurance sector. My responsibilities include estimating and developing new functionalities from scratch, resolving incidents, and updating projects from older versions to the most recent ones. I have over 8 years of experience in Angular, with a solid knowledge of building robust and scalable web applications. Additionally, I have advanced proficiency in version control systems, especially Git. Regarding project deployment and management, we use Azure DevOps. My responsibilities include configuring and maintaining continuous integration and continuous deployment (CI/CD) pipelines to automate the build, test, and deployment processes of our applications. I configure pipeline triggers for automatic integrations and deployments based on specific branches, managing artifacts and dependencies to ensure consistent and controlled deployments. Additionally, I handle the release configuration, creating release definitions that cover multiple environments such as development (DEV), pre-production (PRE), and production (PRO). I implement deployment strategies like blue-green and canary deployments, and use environment variables and specific configurations for each environment to ensure a smooth and secure transition between versions. I have experience configuring Nginx, which we use to manage routes and environment variables necessary for the proper functioning of our applications and the security of API calls.",
        "FULL_NAME": "Full name",
        "PHONE": "Phone",
        "EMAIL": "Email",
        "ADDRESS": "Address",
        "HELLO": "Hello there!",
        "RESUME": "My Resume",
        "WORK": "Work Experience",
        "SENIOR": "Senior Developer",
        "JUNIOR": "Junior Developer",
        "EDUCATION": "Education",
        "BABEL": "During my career at Babel, I worked with AngularJS and all subsequent versions of Angular, including the most recent one. My responsibilities included estimating and developing new features from scratch, troubleshooting issues, and upgrading projects from older versions to the most recent ones. I gained experience in deployment and project management using Azure DevOps. My responsibilities included setting up and maintaining continuous integration and continuous deployment (CI/CD) pipelines, optimizing the build, test, and deployment processes of applications. I configured triggers in the pipelines to automate integrations and deployments based on specific branches, managing artifacts and dependencies to ensure consistent and controlled deployments. I was also responsible for configuring releases, defining release processes that covered multiple environments, such as development (DEV), pre-production (PRE), and production (PRO). I implemented advanced deployment strategies, using environment variables and environment-specific configurations, ensuring smooth and secure transitions between versions. Additionally, I gained experience configuring and administering Nginx, which we used to manage routes and environment variables, optimizing application performance and ensuring the security of API calls.",
        "BETWEEN": "I worked at this company as a full stack developer, leading the development of a project from scratch using Angular 15 for the front-end and .NET for API management. The project evolved under agile methodologies, utilizing tracking and deployment tools such as JIRA, GitLab, and Docker.",
        "ALTEN": "Web application development in Vue 3 application API.Mobile and web application developer for the company Alten using the Angular 12 framework, typescript. Mobile application development in IONIC 5 and Angular 10 for the port of Barcelona. Developing in Angular 2/4/5/6 work with component creation. Use of pipes, creation and use of services. Access to data through HTTP, use of observables, sending HTTP requests, subscriptions to observable collections. Routes and navigation. Use of the ngx-boostrap and ng-bostrap component libraries as well as the NgRx and RxJs library.",
        "WIKOT": "Websites Development and adaptation using programming language like php, html, jquery, javascript. Using framework yii2 and angular.js, as well as the use of content managers such as Wordpress and Prestashop.",
        "AVANADE": "Developing in the monitoring statistics of the integral electonics prescriptions web page (SIRE), in C# language, asp.net, SqlServer database.",
        "SYNERGY": "Development of mobile applications for Android and Blackberry devices aimed at the banking and insurance industry. Survey of requirements in the area of mobility and preparation of time estimates. Responsible for providing training for the use of the git and gitflow tools in the company's projects. I work with clients mainly in Venezuela and Panama. Use of the SCRUM methodology.",
        "OUTSOURCE": "Development of the Human Resources Management System, development of the selection and recruitment staff module, automating the spelling, color and reven tests and developing the modules of contract, vacation, application of Proof of Work, Advance of Benefits, balances of social benefits and performance evaluation, programmed in C# language, asp.net.",
        "MICORP": "Migration from Oracle database to Postgres of the hydrocarbon marketing system (SCH). Development of the ETL and validation module of the migrated data in PHP language.",
        "COMPUTERINFO": "Computer Engineer",
        "UCAB": "Andres Bello Catholic University",
        "COMPUTERTITULO": "Degree in Computer Engineering",
        "COURSE": "Licenses & certifications",
        "QUALIFICATION": "Qualification as Bachelor in Sciences",
        "STUDYTITLE": "Bachelor Degree",
        "COURSETITLE1": "Workshop: Functional Mobile Applications (Programming jQuery Mobile components and dynamic user interaction)",
        "COURSETITLE2": "Workshop: Mobile Application Development with HTML + CSS + JavaScript + jQuery ONLINE",
        "COURSETITLE3": "Workshop: Mobile Application Design with jQuery Mobile (Components and User Interface) ONLINE",
        "COURSETITLE4": "React - The Complete Guide",
        "COURSETITLE5": "React Js",
        "COURSETITLE6": "Ionic 3",
        "CREDENTIALREACT": "Credential UC-3ae1e785-b030-4274-9a9c-e332e2bc6fc0",
        "CREDENTIALREACTJS": "Credential UC-HPCLSXNI",
        "CREDENTIALIONIC3": "Credential UC-ZQ6ND0Z2",
        "CREDENTIALCOURSE1": "Credential COD-83554",
        "CREDENTIALCORUSE2": "Credential COD-83548",
        "CREDENTIALCORUSE3": "Credential COD-83551",
        "SHOWCREDENTIAL": "Show credential",
        "TITLE_WORK": "Work",
        "SKILL": "Skills",
        "HIRE_ME": "Hire Me!",
        "CONTACT_US": "Contact Us",
        "CURRENT": "Current",
        "HIRE_ME_INFO": "With over 12 years of experience in the field of computer science, I am pleased to introduce myself as a highly experienced and passionate Frontend developer, specialized in the latest versions of Angular. Throughout my career, I have cultivated a solid reputation for my commitment to technical excellence, my ability to quickly adapt to new challenges, and my disciplined approach to delivering exceptional results. My journey includes creating innovative and functional user interfaces for a wide range of web applications, from enterprise-scale projects to mobile applications. I have led development teams, bringing not only my technical skills but also my ability to inspire and motivate my colleagues towards collective success. I consider myself a lifelong learner and am constantly seeking new opportunities to expand my knowledge and skills. I am convinced that the technology industry is advancing at a rapid pace, and I am committed to staying abreast of the latest trends and practices to provide cutting-edge solutions to our clients. My focus on responsibility, dedication, and continuous improvement has allowed me to excel in demanding and dynamic environments. I am eager to bring my experience and passion for technology to your team, contributing to the success of your projects and the growth of your company. I am available to discuss how I can be a valuable asset to your team and to answer any questions you may have."
      },
      "SERVICE": {
        "MY_SERVICE": "My services",
        "INTERFACE": "User Interface Development (UI)",
        "DESCRIPTION_INTERFACE": "Create interactive and attractive user interfaces using Angular to enhance user experience.",
        "API_INTEGRATION": "API Integration",
        "API_INTEGRATION_DESCRIPTION": "Connect frontend application with backend services by integrating APIs to efficiently retrieve and send data.",
        "TECNIC": "Technical Consulting and Advisory",
        "TECNIC_DESCRIPTION": "Provide technical advice on Angular best development practices, application architecture, and recommendations to enhance efficiency and scalability.",
        "WEB_APPLICATION": "Web Application Development",
        "WEB_APPLICATION_DESCRIPTION": "Build scalable and efficient web applications using Angular as the main framework.",
        "UPDATE": "Maintenance and Update",
        "UPDATE_INFORMATION": "Provide ongoing maintenance services to ensure that the Angular application is up-to-date, secure, and functioning smoothly.",
        "TEST": "Testing and Debugging",
        "TEST_DESCRIPTION": "Perform exhaustive testing and debugging to identify and solve errors, ensuring code quality and application stability."
      },
      "PROJECT": {
        "TITLE": "Featured Projects",
        "DESCRIPTION": "In my Featured Projects section, I highlight some of the most outstanding works in which I have had the privilege to participate. From innovative web applications to exciting development projects, each project reflects my commitment to excellence and creativity at every step of the process. Explore my selection to discover how I have transformed ideas into tangible and successful solutions.",
        "COMMERZBANK_DESCRIPTION": "Maintenance was carried out on the application at the component level, improvements were made, and incidents reported by the QA department were resolved.",
        "HTG_DESCRIPTION": "In this project, evolutionary processes required by the client were carried out, a table component developed from scratch and customized according to the client's needs was maintained, and work was done on reactive forms. Resolution of incidents in production reported by the client.",
        "PORTIC_DESCRIPTION": "For this project, the frontend part was redesigned to be adapted to the best practices in terms of usability, visibility, and design, resulting in a simpler application oriented to transactions that are carried out in it. A re-engineering of the bases of the applications was carried out, with the purpose of breaking down the current concept of file and thus adapting the applications to the reality that occurs on the platform. For this application, Angular 8 was used, with NgRx libraries for state management, RxJs for asynchronous data management, the application contains a library of client-specific components developed with ngx-boostrap, the application also has a module for multilanguages.",
        "READ_MORE": "Read More",
        "SHOW_LESS": "Show Less"
      },
      "CONTACT": {
        "TITLE": "Contact",
        "FIRST_NAME": "Your first name",
        "VALIDATE_FIRST_NAME": "Complete the first name",
        "LAST_NAME": "Your last name",
        "VALIDATE_LAST_NAME": "Complete the last name",
        "EMAIL_ADDRESS": "Your email address",
        "VALIDATE_EMAIL_ADDRESS": "Complete the email",
        "SUBJECT_MESSAGE": "The subject of this message",
        "VALIDATE_SUBJECT_MESSAGE": "Complete the subject",
        "ABOUT_US": "Your message",
        "VALIDATE_ABOUT_US": "Complete the message",
        "SEND_MESSAGE": "Send message"
      },
      "FOOTER": {
        "TITLE_RESERVED": "2024 Angular. All rights reserved.",
        "DESIGNED": "Designed by"
      }
  }
}