{
    "HOMNE": {
      "INFORMATION": {
        "ABOUT": "Sobre mi",
        "INFO": "Desarrollador de Software",
        "DESCRIPTION": "Desarrollo de proyectos con plataformas Android, Blackberry y Web (Angular 15, Vue 3). Aprendizaje rápido. Motivado. Amplio conocimiento en el sector bancario y de seguros.",
        "DESCRIPTION_ACTUAL": "Soy un desarrollador especializado en frameworks de JavaScript, con un enfoque principal en Angular. He trabajado con AngularJS y con todas las versiones posteriores de Angular, incluyendo la versión más reciente. Actualmente, formo parte de una consultora donde colaboro con clientes del sector asegurador. Mis responsabilidades incluyen la estimación y desarrollo de nuevas funcionalidades desde cero, resolución de incidencias, y actualización de proyectos desde versiones antiguas a las más recientes. Poseo más de 8 años de experiencia en Angular, con un sólido conocimiento en la construcción de aplicaciones web robustas y escalables. Además, tengo un manejo avanzado de sistemas de control de versiones, especialmente Git. En cuanto a despliegue y gestión de proyectos, utilizamos Azure DevOps. Mis responsabilidades incluyen la configuración y mantenimiento de pipelines de integración continua y despliegue continuo (CI/CD) para automatizar los procesos de construcción, pruebas y despliegue de nuestras aplicaciones. Configuro triggers de pipelines para integraciones automáticas y despliegues basados en ramas específicas, gestionando artefactos y dependencias para asegurar despliegues coherentes y controlados. Adicionalmente, manejo la configuración de releases, creando definiciones de release que abarcan múltiples entornos, como desarrollo (DEV), preproducción (PRE) y producción (PRO). Implemento estrategias de despliegue como despliegues blue-green y canary, y utilizo variables de entorno y configuraciones específicas para cada entorno para garantizar una transición fluida y segura entre versiones. Tengo experiencia en la configuración de Nginx, que utilizamos para gestionar las rutas y variables de entorno necesarias para el correcto funcionamiento de nuestras aplicaciones y la seguridad de las llamadas API.",
        "FULL_NAME": "Nombre completo",
        "PHONE": "Teléfono",
        "EMAIL": "Email",
        "ADDRESS": "Dirección",
        "HELLO": "Hola!",
        "RESUME": "Mi currículum",
        "WORK": "Experiencia laboral",
        "SENIOR": "Desarrollador Senior",
        "JUNIOR": "Desarrollador Junior",
        "EDUCATION": "Education",
        "BABEL": "Desarrollador Front-end en aplicaciones de seguros con Angular 15",
        "ALTEN": "Desarrollo de aplicaciones web en la API de Vue 3. Desarrollador de aplicaciones móviles y web para la empresa Alten utilizando el framework Angular 12, TypeScript. Desarrollo de aplicaciones móviles en IONIC 5 y Angular 10 para el puerto de Barcelona. Desarrollo en Angular 2/4/5/6 con creación de componentes. Uso de tuberías, creación y uso de servicios. Acceso a datos a través de HTTP, uso de observables, envío de solicitudes HTTP, suscripciones a colecciones observables. Rutas y navegación. Uso de las bibliotecas de componentes ngx-boostrap y ng-bostrap, así como de la biblioteca NgRx y RxJs.",
        "WIKOT": "Desarrollo y adaptación de sitios web utilizando lenguajes de programación como PHP, HTML, jQuery, JavaScript. Uso del framework yii2 y angular.js, así como el uso de gestores de contenido como Wordpress y Prestashop.",
        "AVANADE": "Desarrollo en la estadísticas de seguimiento de la página web de recetas electrónicas integrales (SIRE), en lenguaje C#, asp.net, base de datos SqlServer.",
        "SYNERGY": "Desarrollo de aplicaciones móviles para dispositivos Android y Blackberry dirigidas a la industria bancaria y de seguros. Análisis de requisitos en el área de movilidad y preparación de estimaciones de tiempo. Responsable de proporcionar formación para el uso de las herramientas git y gitflow en los proyectos de la empresa. Trabajo con clientes principalmente en Venezuela y Panamá. Uso de la metodología SCRUM.",
        "OUTSOURCE": "Desarrollo del Sistema de Gestión de Recursos Humanos, desarrollo del módulo de selección y reclutamiento de personal, automatización de las pruebas de ortografía, color y reven, y desarrollo de los módulos de contrato, vacaciones, aplicación de Prueba de Trabajo, Anticipo de Beneficios, balances de beneficios sociales y evaluación de rendimiento, programado en lenguaje C#, asp.net.",
        "MICORP": "Migración de la base de datos Oracle a Postgres del sistema de marketing de hidrocarburos (SCH). Desarrollo del módulo de ETL y validación de los datos migrados en lenguaje PHP.",
        "COMPUTERINFO": "Ingeniero Informático",
        "COMPUTERTITULO": "Titulación como Ingeniero Informático",
        "COURSE": "Licencias y certificaciones",
        "QUALIFICATION": "Titulación como bachiller en ciencias",
        "STUDYTITLE": "Grado Bachiller",
        "COURSETITLE1": "Jornada: Aplicaciones Móviles funcionales (Programación de componentes de jQuery mobile e interacción dinámica con el usuario)",
        "COURSETITLE2": "Jornada: Desarrollo Aplicación Móvil con HTML + CSS + JavaScript + jQuery ONLINE",
        "COURSETITLE3": "Jornada: Diseño Aplicación Móvil con jQuery mobile (Componentes e interfaz de usuario) ONLINE",
        "COURSETITLE4": "React - The Complete Guide",
        "COURSETITLE5": "React Js",
        "COURSETITLE6": "Ionic 3",
        "CREDENTIALREACT": "Credencial UC-3ae1e785-b030-4274-9a9c-e332e2bc6fc0",
        "CREDENTIALREACTJS": "Credencial UC-HPCLSXNI",
        "CREDENTIALIONIC3": "Credencial UC-ZQ6ND0Z2",
        "CREDENTIALCOURSE1": "Credencial COD-83554",
        "CREDENTIALCORUSE2": "Credencial COD-83548",
        "CREDENTIALCORUSE3": "Credencial COD-83551",
        "SHOWCREDENTIAL": "Mostrar credencial",
        "TITLE_WORK": "Trabajo",
        "SKILL": "Habilidades",
        "HIRE_ME": "Contrátame!",
        "CONTACT_US": "Contáctenos",
        "HIRE_ME_INFO": "Con más de 12 años de experiencia en el mundo de la informática, me complace presentarme como un desarrollador Frontend altamente experimentado y apasionado, especializado en las últimas versiones de Angular. A lo largo de mi carrera, he cultivado una sólida reputación por mi compromiso con la excelencia técnica, mi habilidad para adaptarme rápidamente a nuevos desafíos y mi enfoque disciplinado en la entrega de resultados excepcionales. Mi trayectoria incluye la creación de interfaces de usuario innovadoras y funcionales para una amplia gama de aplicaciones web, desde proyectos de escala empresarial hasta aplicaciones móviles. He liderado equipos de desarrollo, aportando no solo mis habilidades técnicas, sino también mi capacidad para inspirar y motivar a mis colegas hacia el éxito conjunto. Me considero un eterno aprendiz y estoy constantemente buscando nuevas oportunidades para expandir mis conocimientos y habilidades. Estoy convencido de que la industria de la tecnología avanza a un ritmo vertiginoso, y estoy comprometido a mantenerme al tanto de las últimas tendencias y prácticas para ofrecer soluciones de vanguardia a nuestros clientes. Mi enfoque en la responsabilidad, la dedicación y la mejora continua me ha permitido sobresalir en entornos exigentes y dinámicos. Estoy ansioso por llevar mi experiencia y pasión por la tecnología a su equipo, contribuyendo al éxito de sus proyectos y al crecimiento de su empresa. Quedo a su disposición para discutir cómo puedo ser un activo valioso para su equipo y para responder cualquier pregunta que pueda tener."
      },
      "SERVICE": {
        "MY_SERVICE": "Mis servicios",
        "INTERFACE": "Desarrollo de interfaces de usuario (UI)",
        "DESCRIPTION_INTERFACE": "Crear interfaces de usuario interactivas y atractivas utilizando Angular para mejorar la experiencia del usuario.",
        "API_INTEGRATION": "Integración de API",
        "API_INTEGRATION_DESCRIPTION": "Conectar la aplicación frontend con servicios backend mediante la integración de API para obtener y enviar datos de forma eficiente.",
        "TECNIC": "Consultoría y asesoramiento técnico",
        "TECNIC_DESCRIPTION": "Brindar asesoramiento técnico sobre las mejores prácticas de desarrollo en Angular, arquitectura de aplicaciones, y recomendaciones para mejorar la eficiencia y la escalabilidad.",
        "WEB_APPLICATION": "Desarrollo de aplicaciones web",
        "WEB_APPLICATION_DESCRIPTION": "Construir aplicaciones web escalables y eficientes utilizando Angular como framework principal.",
        "UPDATE": "Mantenimiento y actualización",
        "UPDATE_INFORMATION": "Proporcionar servicios de mantenimiento continuo para asegurar que la aplicación Angular esté actualizada, segura y funcione sin problemas.",
        "TEST": "Pruebas y depuración",
        "TEST_DESCRIPTION": "Realizar pruebas exhaustivas y depuración para identificar y solucionar errores, asegurando la calidad del código y la estabilidad de la aplicación."
      },
      "PROJECT": {
        "TITLE": "Proyectos Destacados",
        "DESCRIPTION": "En mi sección de Proyectos Destacados, destaco algunos de los trabajos más sobresalientes en los que he tenido el privilegio de participar. Desde innovadoras aplicaciones web hasta emocionantes proyectos de desarrollo, cada proyecto refleja mi compromiso con la excelencia y la creatividad en cada paso del proceso. Explora mi selección para descubrir cómo he transformado ideas en soluciones tangibles y exitosas.",
        "COMMERZBANK_DESCRIPTION": "Se realizó mantenimiento en la aplicación a nivel de componente, se realizaron mejoras y se resolvieron los incidentes reportados por el departamento de control de calidad (QA).",
        "HTG_DESCRIPTION": "En este proyecto, se llevaron a cabo procesos evolutivos requeridos por el cliente, se mantuvo un componente de tabla desarrollado desde cero y personalizado según las necesidades del cliente, y se trabajó en formularios reactivos. Se resolvieron incidentes en producción reportados por el cliente.",
        "PORTIC_DESCRIPTION": "Para este proyecto, se rediseñó la parte del frontend para adaptarla a las mejores prácticas en términos de usabilidad, visibilidad y diseño, lo que resultó en una aplicación más simple orientada a las transacciones que se realizan en ella. Se llevó a cabo una reingeniería de las bases de las aplicaciones con el propósito de desglosar el concepto actual de archivo y así adaptar las aplicaciones a la realidad que ocurre en la plataforma. Para esta aplicación, se utilizó Angular 8, con las bibliotecas NgRx para la gestión del estado, RxJs para la gestión de datos asincrónicos, la aplicación contiene una biblioteca de componentes específicos del cliente desarrollada con ngx-boostrap, la aplicación también cuenta con un módulo para múltiples idiomas.",
        "READ_MORE": "Leer más",
        "SHOW_LESS": "Mostrar menos"
      },
      "CONTACT": {
        "TITLE": "Contacto",
        "FIRST_NAME": "Tu nombre",
        "VALIDATE_FIRST_NAME": "Completa el nombre",
        "LAST_NAME": "Tu apellido",
        "VALIDATE_LAST_NAME": "Completa el apellido",
        "EMAIL_ADDRESS": "Tu dirección de correo electronico",
        "VALIDATE_EMAIL_ADDRESS": "Completa el email",
        "SUBJECT_MESSAGE": "El asunto de este mensaje",
        "VALIDATE_SUBJECT_MESSAGE": "Completa el asunto",
        "ABOUT_US": "Tu mensaje",
        "VALIDATE_ABOUT_US": "Completa el mensaje",
        "SEND_MESSAGE": "Enviar mensaje"
      },
      "FOOTER": {
        "TITLE_RESERVED": "2024 Angular. Todos los derechos reservados.",
        "DESIGNED": "Diseñado por"
      }
  }
}
  